ErpTest/src/Documents/СписаниеНМА2_4/СписаниеНМА2_4.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеНМА2_4</name>
  <basedOn>Catalog.НематериальныеАктивы</basedOn>
  <registerRecords>InformationRegister.ПервоначальныеСведенияНМАНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>InformationRegister.ПорядокУчетаНМАУУ</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДоходыРасходыПрочиеАктивыПассивы</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияНМА</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьНМА</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ПорядокУчетаНМАБУ</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccumulationRegister.АмортизацияНМА</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <registerRecords>InformationRegister.МестоУчетаНМА</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияНМАБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ВыручкаИСебестоимостьПродаж</registerRecords>
  <attributes>
    <name>ОтражатьВУпрУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВРеглУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНаОсновании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ИнвентаризацияНМА</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастичнаяЛиквидация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВДругомУчете</name>
    <type>
      <types>DocumentRef.СписаниеНМА2_4</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НМА</name>
    <attributes>
      <name>НематериальныйАктив</name>
      <type>
        <types>CatalogRef.НематериальныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСписанияУУ</name>
      <type>
        <types>DefinedType.ДенежноеПолеНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСписанияБУ</name>
      <type>
        <types>DefinedType.ДенежноеПолеНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСписанияНУ</name>
      <type>
        <types>DefinedType.ДенежноеПолеНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСписанияПР</name>
      <type>
        <types>DefinedType.ДенежноеПолеНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСписанияВР</name>
      <type>
        <types>DefinedType.ДенежноеПолеНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/InformationRegisters/ДокументыПоНМА/ДокументыПоНМА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыПоНМА</name>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтражатьВРеглУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтражатьВУпрУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипСсылки</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НематериальныйАктив</name>
    <type>
      <types>CatalogRef.НематериальныеАктивы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.ПодготовкаКПередачеНМА</types>
      <types>DocumentRef.ПереоценкаНМА2_4</types>
      <types>DocumentRef.ПодготовкаКПередачеНМА2_4</types>
      <types>DocumentRef.ИзменениеПараметровНМАМеждународныйУчет</types>
      <types>DocumentRef.ВводОстатковНМАМеждународныйУчет</types>
      <types>DocumentRef.СписаниеНМАМеждународныйУчет</types>
      <types>DocumentRef.ПеремещениеНМАМеждународныйУчет</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.ИзменениеПараметровНМА</types>
      <types>DocumentRef.ВводОстатковВнеоборотныхАктивов2_4</types>
      <types>DocumentRef.ПереоценкаНМА</types>
      <types>DocumentRef.ВводОстатковВнеоборотныхАктивов</types>
      <types>DocumentRef.ПринятиеКУчетуНМА2_4</types>
      <types>DocumentRef.ПеремещениеНМА2_4</types>
      <types>DocumentRef.ВыработкаНМА</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.СписаниеНМА2_4</types>
      <types>DocumentRef.ПринятиеКУчетуНМАМеждународныйУчет</types>
      <types>DocumentRef.ИзменениеПараметровНМА2_4</types>
      <types>DocumentRef.ПринятиеКУчетуНМА</types>
      <types>DocumentRef.ИнвентаризацияНМА</types>
      <types>DocumentRef.СписаниеНМА</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/ПервоначальныеСведенияНМА/ПервоначальныеСведенияНМА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПервоначальныеСведенияНМА</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СпособПоступления</name>
    <type>
      <types>EnumRef.СпособыПоступленияАктивов</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимостьУУ</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимостьБУ</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимостьНУ</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимостьПР</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимостьВР</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>МетодНачисленияАмортизацииБУ</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииНМА</types>
    </type>
  </resources>
  <resources>
    <name>МетодНачисленияАмортизацииНУ</name>
    <type>
      <types>EnumRef.МетодыНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АмортизацияДо2002</name>
    <comment>Сумма амортизационных начислений до 01.01.2002 для НУ</comment>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>АмортизацияДо2009</name>
    <type>
      <types>DefinedType.ДенежноеПолеНеотрицательное</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДо2002</name>
    <comment>Первоначальная (вост.) стоимость до 01.01.2002 для НУ</comment>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>ФактическийСрокИспользованияДо2009</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПриобретения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПринятияКУчетуУУ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПринятияКУчетуБУ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументПринятияКУчетуУУ</name>
    <type>
      <types>DocumentRef.ВводОстатковНМАМеждународныйУчет</types>
      <types>DocumentRef.ВводОстатковВнеоборотныхАктивов2_4</types>
      <types>DocumentRef.ВводОстатковВнеоборотныхАктивов</types>
      <types>DocumentRef.ПринятиеКУчетуНМА2_4</types>
      <types>DocumentRef.ПринятиеКУчетуНМАМеждународныйУчет</types>
      <types>DocumentRef.ПринятиеКУчетуНМА</types>
    </type>
  </resources>
  <resources>
    <name>ДокументПринятияКУчетуБУ</name>
    <type>
      <types>DocumentRef.ВводОстатковВнеоборотныхАктивов2_4</types>
      <types>DocumentRef.ВводОстатковВнеоборотныхАктивов</types>
      <types>DocumentRef.ПринятиеКУчетуНМА2_4</types>
      <types>DocumentRef.ПринятиеКУчетуНМА</types>
    </type>
  </resources>
  <resources>
    <name>ДокументСписания</name>
    <type>
      <types>DocumentRef.ПодготовкаКПередачеНМА2_4</types>
      <types>DocumentRef.СписаниеНМА2_4</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокУчетаНУ</name>
    <type>
      <types>EnumRef.ПорядокУчетаСтоимостиВнеоборотныхАктивов</types>
    </type>
  </resources>
  <dimensions>
    <name>НематериальныйАктив</name>
    <type>
      <types>CatalogRef.НематериальныеАктивы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/ПорядокУчетаНМА/ПорядокУчетаНМА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПорядокУчетаНМА</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаВнеоборотныхАктивов</types>
    </type>
  </resources>
  <resources>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемНаработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОтражатьВУпрУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВРеглУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>НематериальныйАктив</name>
    <type>
      <types>CatalogRef.НематериальныеАктивы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/МестоУчетаНМА/МестоУчетаНМА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МестоУчетаНМА</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <attributes>
    <name>ОтражатьВРеглУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВУпрУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>НематериальныйАктив</name>
    <type>
      <types>CatalogRef.НематериальныеАктивы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Documents/СписаниеНМА2_4/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент();
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.НематериальныеАктивы") Тогда
		ЗаполнитьНаОснованииНематериальногоАктива(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.СписаниеНМА2_4") Тогда
		ЗаполнитьНаОснованииСписания(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ИнвентаризацияНМА") Тогда
		ЗаполнитьНаОснованииИнвентаризации(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ВнеоборотныеАктивы.ПроверитьСоответствиеДатыВерсииУчета(ЭтотОбъект, Истина, Отказ);
	
	УправлениеВнеоборотнымиАктивамиПереопределяемый.ПроверитьОтсутствиеДублейВТабличнойЧасти(
		ЭтотОбъект, "НМА", Новый Структура("НематериальныйАктив"), Отказ);
		
	НепроверяемыеРеквизиты = Новый Массив;
	
	ПараметрыРеквизитовОбъекта = ВнеоборотныеАктивыКлиентСервер.ЗначенияСвойствЗависимыхРеквизитов_СписаниеНМА(ЭтотОбъект);
	ВнеоборотныеАктивыСлужебный.ОтключитьПроверкуЗаполненияРеквизитовОбъекта(ПараметрыРеквизитовОбъекта, НепроверяемыеРеквизиты);
	
	ПланыВидовХарактеристик.СтатьиРасходов.ПроверитьЗаполнениеАналитик(
		ЭтотОбъект,
		"СтатьяРасходов, АналитикаРасходов",
		НепроверяемыеРеквизиты,
		Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ВнеоборотныеАктивыСлужебный.ПроверитьЧтоНМАПринятыКУчету(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	ЗначенияСвойствЗависимыхРеквизитов =
		ВнеоборотныеАктивыКлиентСервер.ЗначенияСвойствЗависимыхРеквизитов_СписаниеНМА(ЭтотОбъект);
	ВнеоборотныеАктивыСлужебный.ОчиститьНеиспользуемыеРеквизиты(ЭтотОбъект, ЗначенияСвойствЗависимыхРеквизитов);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ И ДополнительныеСвойства.РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		Документы.СписаниеНМА2_4.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства, "РеестрДокументов, ДокументыПоНМА");
		РегистрыСведений.РеестрДокументов.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);
		РегистрыСведений.ДокументыПоНМА.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументВДругомУчете = Неопределено;
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ЗаблокироватьЧитаемыеДанные();
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.СписаниеНМА2_4.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ПроведениеСерверУТ.ЗагрузитьТаблицыДвижений(ДополнительныеСвойства, Движения);
	РегистрыСведений.РеестрДокументов.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);
	РегистрыСведений.ДокументыПоНМА.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);
	
	РеглУчетПроведениеСервер.ЗарегистрироватьКОтражению(ЭтотОбъект, ДополнительныеСвойства, Движения, Отказ);
	//++ НЕ УТКА
	МеждународныйУчетПроведениеСервер.ЗарегистрироватьКОтражению(ЭтотОбъект, ДополнительныеСвойства, Движения, Отказ);
	//-- НЕ УТКА
	
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДокумент()
	
	Ответственный = Пользователи.ТекущийПользователь();
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Подразделение = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Ответственный, Подразделение);
	
	ОтражатьВУпрУчете = Истина;
	ОтражатьВРеглУчете = ВнеоборотныеАктивыСлужебный.ДоступенВыборОтраженияВУчетах(ТекущаяДатаСеанса());
	
КонецПроцедуры

Процедура ЗаблокироватьЧитаемыеДанные()
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПервоначальныеСведенияНМА");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = НМА;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("НематериальныйАктив", "НематериальныйАктив");
	ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПорядокУчетаНМА");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	ЭлементБлокировки.ИсточникДанных = НМА;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("НематериальныйАктив", "НематериальныйАктив");
	ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.МестоУчетаНМА");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	ЭлементБлокировки.ИсточникДанных = НМА;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("НематериальныйАктив", "НематериальныйАктив");
	
	Если ОтражатьВУпрУчете Тогда
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПорядокУчетаНМАУУ");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = НМА;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("НематериальныйАктив", "НематериальныйАктив");
		ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПараметрыАмортизацииНМАУУ");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировки.ИсточникДанных = НМА;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("НематериальныйАктив", "НематериальныйАктив");
		ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	КонецЕсли;
	
	Если ОтражатьВРеглУчете Тогда
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПорядокУчетаНМАБУ");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = НМА;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("НематериальныйАктив", "НематериальныйАктив");
		ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	КонецЕсли;
	
	Блокировка.Заблокировать(); 
	
КонецПроцедуры

Процедура ЗаполнитьДокументПоОтбору(Основание)

	Если Основание.Свойство("НематериальныйАктив") Тогда
		ЗаполнитьНаОснованииНематериальногоАктива(Основание.НематериальныйАктив);
	ИначеЕсли Основание.Свойство("ДокументОснование")
		И ТипЗнч(Основание.ДокументОснование) = Тип("ДокументСсылка.ИнвентаризацияНМА") Тогда
		ЗаполнитьНаОснованииИнвентаризации(Основание);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииНематериальногоАктива(Основание)
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "ЭтоГруппа");
	
	Если РеквизитыОснования.ЭтоГруппа Тогда
		
		ТекстСообщения = НСтр("ru = 'Списание на основании группы НМА невозможно.
			|Выберите НМА. Для раскрытия группы используйте клавиши Ctrl и стрелку вниз.'");
		ВызватьИсключение(ТекстСообщения);
		
	КонецЕсли;
	
	ПервоначальныеСведения = ВнеоборотныеАктивыСлужебный.СообщитьЕслиНМАНеПринятКУчету(Основание, Дата);

	ОтражатьВУпрУчете = ЗначениеЗаполнено(ПервоначальныеСведения.ДокументПринятияКУчетуУУ);
	ОтражатьВРеглУчете = ЗначениеЗаполнено(ПервоначальныеСведения.ДокументПринятияКУчетуБУ);
	
	МестоУчетаНМА = ВнеоборотныеАктивы.МестоУчетаНМА(Основание);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, МестоУчетаНМА);
	
	СтрокаТабличнойЧасти = НМА.Добавить();
	СтрокаТабличнойЧасти.НематериальныйАктив = Основание;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииСписания(Основание, НематериальныйАктив = Неопределено)

	ОснованиеОбъект = Основание.ПолучитьОбъект();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ОснованиеОбъект,, "Номер,Дата,ВерсияДанных,Ответственный,ПометкаУдаления,Проведен");
	ДокументВДругомУчете = Основание;
	
	Если НЕ ЗначениеЗаполнено(НематериальныйАктив) Тогда
		Для каждого СтрокаОснования Из ОснованиеОбъект.НМА Цикл
			СтрокаТабличнойЧасти = НМА.Добавить();
			СтрокаТабличнойЧасти.НематериальныйАктив = СтрокаОснования.НематериальныйАктив;
		КонецЦикла; 
		НМА.Загрузить(ОснованиеОбъект.НМА.Выгрузить());
	Иначе
		СтрокаТабличнойЧасти = НМА.Добавить();
		СтрокаТабличнойЧасти.НематериальныйАктив = НематериальныйАктив;
	КонецЕсли; 
	
	Если ВнеоборотныеАктивыСлужебный.ДоступенВыборОтраженияВУчетах(Дата) Тогда
		Если ОснованиеОбъект.ОтражатьВРеглУчете Тогда
			ОтражатьВРеглУчете = Ложь;
			ОтражатьВУпрУчете  = Истина;
		Иначе
			ОтражатьВРеглУчете = Истина;
			ОтражатьВУпрУчете  = Ложь;
		КонецЕсли; 
	Иначе	
		ОтражатьВРеглУчете = Ложь;
		ОтражатьВУпрУчете  = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииИнвентаризации(ДанныеЗаполнения)
	
	ДокументНаОсновании = Истина;
	
	Организация = Справочники.Организации.ПустаяСсылка();
	Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();
	
	МассивНомеровСтрок = Неопределено;
	СообщатьОбОшибках = Истина;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДокументОснование = ДанныеЗаполнения.ДокументОснование;
		МассивНомеровСтрок = ДанныеЗаполнения.МассивНомеровСтрок;
		СообщатьОбОшибках = ДанныеЗаполнения.СообщатьОбОшибках;
	Иначе
		ДокументОснование = ДанныеЗаполнения;
	КонецЕсли;
	
	Документы.СписаниеНМА2_4.ЗаполнитьНаОснованииИнвентаризации(ЭтотОбъект, СообщатьОбОшибках, МассивНомеровСтрок);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
